opdracht-diagrammen/FlightOffers.plantuml
@startuml
set separator none
title Triptop - Containers

top to bottom direction

!include <C4/C4>
!include <C4/C4_Context>
!include <C4/C4_Container>

Person(Reiziger, "Reiziger", $descr="Gebruiker die zijn reis plant, boekt en beheert.", $tags="", $link="")
Person(TweedelijnsReisagent, "Tweede-lijns Reisagent", $descr="Ondersteunt reizigers bij het plannen en boeken van hun reis.", $tags="", $link="")
System_Ext(IdentityProvider, "Identity Provider", $descr="OAuth2-provider waarmee gebruikers kunnen inloggen via Google, Microsoft, AirBnb, etc.", $type="Software System", $tags="", $link="")
System_Ext(VervoerAPI, "Vervoer API", $descr="Externe API's zoals NS, KLM en Deutsche Bahn voor het boeken van vervoer.", $type="Software System", $tags="", $link="")
System_Ext(Betaalprovider, "Betaalprovider", $descr="Externe dienst voor betalingsverwerking.", $type="Software System",$tags="", $link="")

System_Boundary("Triptop_boundary", "Triptop", $tags="") {
  Container(Triptop.FrontendWebapplicatie, "Frontend Webapplicatie", $techn="React, JavaScript", $descr="De UI waarmee gebruikers hun reizen plannen en boeken.", $tags="", $link="")
  Container(Triptop.BackendAPI, "Backend API", $techn="Java Spring Boot", $descr="Beheert logica voor reizen, boekingen, betalingen en authenticatie.", $tags="", $link="")
  Container(Triptop.Database, "Database", $techn="MySQL", $descr="Slaat gebruikersgegevens, boekingen en reisopties op.", $tags="", $link="")
}

Rel(Reiziger, Triptop.FrontendWebapplicatie, "Gebruikt voor het plannen en boeken van reizen", $techn="HTTPS", $tags="", $link="")
Rel(TweedelijnsReisagent, Triptop.FrontendWebapplicatie, "Gebruikt voor het ondersteunen van reizigers", $techn="HTTPS", $tags="", $link="")
Rel(Triptop.FrontendWebapplicatie, Triptop.BackendAPI, "Maakt API-aanvragen naar", $techn="HTTPS/JSON", $tags="", $link="")
Rel(Triptop.BackendAPI, Triptop.Database, "Leest en schrijft gegevens", $techn="JDBC", $tags="", $link="")
Rel(Triptop.BackendAPI, IdentityProvider, "Authenticeert gebruikers via", $techn="HTTPS/OAuth2/JWT", $tags="", $link="")
Rel(Triptop.BackendAPI, VervoerAPI, "Haalt reisopties op van", $techn="HTTPS/REST/JSON", $tags="", $link="")
Rel(Triptop.BackendAPI, Betaalprovider, "Verwerkt betalingen via", $techn="HTTPS/REST/JSON", $tags="", $link="")

SHOW_LEGEND(true)
@enduml
